
CBTitreFenetrePortefeuille = "%@ - Liste des comptes";
CBTitreFenetreCompte = "%@ - Compte %@ (%@)";

CBDefautNomPortefeuille = "<Nom>";
CBDefautPrenomPortefeuille = "<Prénom>";
CBDefautTitreCategorie = "<Nouvelle catégorie>";
CBDefautBanqueCompte = "<Nom de la banque>";
CBDefautNumeroCompte = "<Numéro du compte>";
CBDefautLibellePredefini = "<Nouveau libellé>";
CBDefautLibelleMouvement = "<Libellé du mouvement>";
CBDefautTitreMouvementPeriodique = "<Titre du mouvement périodique>";


CBBoutonOK = "OK";
CBBoutonAnnuler = "Annuler";
CBTitreAlertSuppressionCategorieMouvement = "Confirmation de suppression";
CBContenuAlertSuppressionCategorieMouvement = "Voulez-vous vraiment supprimer la catégorie \"%@\" (%@ mouvements liés) ?";
CBTitreAlertSuppressionCompte = "Confirmation de suppression";
CBContenuAlertSuppressionCompte = "Voulez-vous vraiment supprimer le compte %@ (%@) ?";
CBTitreAlertSuppressionLibellePredefini = "Confirmation de suppression";
CBContenuAlertSuppressionLibellePredefini = "Voulez-vous vraiment supprimer le libellé prédéfini \"%@\" ?";
CBTitreAlertSuppressionMouvement = "Confirmation de suppression";
CBContenuAlertSuppressionMouvement = "Voulez-vous vraiment supprimer le(s) mouvement(s) sélectionné(s) ?";
CBTitreAlertSuppressionMouvementPeriodique = "Confirmation de suppression";
CBContenuAlertSuppressionMouvementPeriodique = "Voulez-vous vraiment supprimer le mouvement périodique \"%@\" ?";

CBTitreAlertFermerComptesEcritureAutomatique = "Ecritures automatiques en suspens";
CBContenuAlertFermerComptesEcritureAutomatique = "Vous devez fermer toutes les fenêtres de compte (aucun compte ne doit être en cours d'édition lors de cette opération).";

CBTitreAlertAucuneEcritureAutomatique = "Ecritures automatiques en suspens";
CBContenuAlertAucuneEcritureAutomatique = "Il n'y a aucune écriture automatique en suspens.";

CBTitreAlertFermerComptesClotureExercice = "Clôture de l'exercice";
CBContenuAlertFermerComptesClotureExercice = "Vous devez fermer toutes les fenêtres de compte (aucun compte ne doit être en cours d'édition lors de cette opération).";

CBLibellePourTypeMouvement0 = "Indéfini";
CBLibellePourTypeMouvement1 = "Carte Bleue";
CBLibellePourTypeMouvement2 = "Prélèvement";
CBLibellePourTypeMouvement3 = "Chq. %@";
CBLibellePourTypeMouvement4 = "Chq. ES %@";
CBLibellePourTypeMouvement5 = "Virement Débiteur";
CBLibellePourTypeMouvement6 = "Virement Créditeur";
CBLibellePourTypeMouvement7 = "Dépôt";

CBTypeDocumentMessageErreur = "Les documents de type \"%@\" ne sont pas gérés.";
CBContenuFichierMessageErreur = "Le contenu du fichier est invalide.";
CBFichierSauvegardeMessageErreur = "Problème lors de l'écriture du fichier de sauvegarde";
CBFichierTXTMessageErreur = "Problème lors de l'écriture du fichier texte";
CBLargeurPapierTitreErreur = "La largeur du papier est insuffisante.";
CBLargeurPapierMessageErreur = "Augmentez la largeur du papier ou diminuez l'échelle (menu Fichier > Format d'impression).";

CBTitreAlertConversionAncienFichier = "Ouverture d'un ancien fichier";
CBContenuAlertConversionAncienFichier = "Le fichier sera converti au nouveau format.";

CBFormatageNilMessageErreur = "Vous devez saisir une valeur.";
CBFormatageNegativeMessageErreur = "Les valeurs négatives sont interdites.";
CBFormatageInvalideMessageErreur = "La valeur saisie n'est pas numérique.";
CBFormatageCaracteresInterditsMessageErreur = "Des caractères interdits ont été saisis.";

/* Valeurs pour la génération des fichiers TXT */
CBEnteteTXTPortefeuille = "%@\nSolde total des comptes\t%@\nBanque\tNuméro de compte\tSolde réel\tSolde banque\n";
CBLigneTXTPortefeuille = "%@\t%@\t%@\t%@\n";
CBEnteteTXTCompte = "Compte %@\n%@\nSolde réel\t%@\nSolde banque\t%@\nCB en cours\t%@\nDate\tOpération\tLibellé\tCatégorie\tDébit\tPointage\tCrédit\tAvoir\n";
CBLigneTXTCompte = "%@\t%@\t%@\t%@\t%@\t%@\t%@\t%@\n";

/* Valeurs pour l'impression des ornements de pages */
CBHautPagePortefeuille = "Liste des comptes de %@";
CBHautPageCompte = "Détail du compte %@ (%@)";
CBImpressionNumeroPage = "Page %d/%d";
CBImpressionDate = "Imprimé le %@";

/* Valeurs pour l'impression du portefeuille */
CBEnteteGeneralSoldeTotal = "Solde total des comptes : %@";
CBEnteteTableauBanque = "Banque";
CBEnteteTableauNumeroCompte = "Numéro de compte";
CBEnteteTableauSoldeReel = "Solde réel";
CBEnteteTableauSoldeBanque = "Solde banque";

/* Valeurs pour l'impression du compte */
CBEnteteGeneralCompte = "Compte %@";
CBEnteteGeneralSoldeReel = "Solde réel : %@";
CBEnteteGeneralSoldeBanque = "Solde banque : %@";
CBEnteteGeneralSoldeCBEnCours = "CB en cours : %@";
CBEnteteTableauDate = "Date";
CBEnteteTableauOperation = "Opération";
CBEnteteTableauLibelle = "Libellé";
CBEnteteTableauCategorie = "Catégorie";
CBEnteteTableauDebit = "Débit";
CBEnteteTableauPointage = "√";
CBEnteteTableauCredit = "Crédit";
CBEnteteTableauAvoir = "Avoir";

/* Valeurs pour la reprise des anciens fichiers CBA (ne pas traduire) */
CBLegacyValeurOperationCarteBleue = "Carte Bleue";
CBLegacyValeurOperationPrelevement = "Prélèvement";
CBLegacyValeurOperationCheque = "Chèque";
CBLegacyValeurOperationVirement = "Virement";
CBLegacyValeurOperationDepot = "Dépôt";
CBLegacyValeurPointage = "√";
